alxhoff/STM32-Mechanical-Keyboard/NuceloKeyboardController/Src/visEffect.c
//				}
			}
		}
	}
}


void LED_dots(key_devices_t* keyboard_devs)
{
	for(uint8_t j = 0; j < KEYBOARD_ROWS; j++){
		for(uint8_t i = 0; i < sizeof(keyboard_devs->LEDs->buffers[0]) / 3; i++){
			if(rand() % keyboard_devs->LEDs->dots_random == 0){
				keyboard_devs->LEDs->buffers[j][i*3 + 0] = 255;
				keyboard_devs->LEDs->buffers[j][i*3 + 1] = 255;
				keyboard_devs->LEDs->buffers[j][i*3 + 2] = 255;
			}

			if(keyboard_devs->LEDs->buffers[j][i*3 + 0] > keyboard_devs->LEDs->dots_fade_out)
				keyboard_devs->LEDs->buffers[j][i*3 + 0] -=
						keyboard_devs->LEDs->buffers[j][i*3 + 0]/keyboard_devs->LEDs->dots_fade_out;
			else
				keyboard_devs->LEDs->buffers[j][i*3 + 0] = 0;

			if(keyboard_devs->LEDs->buffers[j][i*3 + 1] > keyboard_devs->LEDs->dots_fade_out)
				keyboard_devs->LEDs->buffers[j][i*3 + 1] -=
						keyboard_devs->LEDs->buffers[j][i*3 + 1]/keyboard_devs->LEDs->dots_fade_out;
			else
				keyboard_devs->LEDs->buffers[j][i*3 + 1] = 0;

			if(keyboard_devs->LEDs->buffers[j][i*3 + 2] > keyboard_devs->LEDs->dots_fade_out)
				keyboard_devs->LEDs->buffers[j][i*3 + 2] -=
						keyboard_devs->LEDs->buffers[j][i*3 + 2]/keyboard_devs->LEDs->dots_fade_out;
			else
				keyboard_devs->LEDs->buffers[j][i*3 + 2] = 0;
		}
	}
}

void LED_RGB_dots_fade(key_devices_t* keyboard_devs)
{
	for(uint8_t j = 0; j < KEYBOARD_ROWS; j++){
		for(uint8_t i = 0; i < sizeof(keyboard_devs->LEDs->buffers[0]) / 3; i++){
			if(rand() % keyboard_devs->LEDs->dots_random == 0){
				uint32_t color = Wheel((rand() % 255));

				keyboard_devs->LEDs->buffers[j][i*3 + 0] = color & 0xFF;
				keyboard_devs->LEDs->buffers[j][i*3 + 1] = color >> 8 & 0xFF;
				keyboard_devs->LEDs->buffers[j][i*3 + 2] = color >> 16 & 0xFF;
			}

			if(keyboard_devs->LEDs->buffers[j][i*3 + 0] > keyboard_devs->LEDs->dots_fade_out)
				keyboard_devs->LEDs->buffers[j][i*3 + 0] -=
						keyboard_devs->LEDs->buffers[j][i*3 + 0]/keyboard_devs->LEDs->dots_fade_out;
			else
				keyboard_devs->LEDs->buffers[j][i*3 + 0] = 0;

			if(keyboard_devs->LEDs->buffers[j][i*3 + 1] > keyboard_devs->LEDs->dots_fade_out)
				keyboard_devs->LEDs->buffers[j][i*3 + 1] -=
						keyboard_devs->LEDs->buffers[j][i*3 + 1]/keyboard_devs->LEDs->dots_fade_out;
			else
				keyboard_devs->LEDs->buffers[j][i*3 + 1] = 0;

			if(keyboard_devs->LEDs->buffers[j][i*3 + 2] > keyboard_devs->LEDs->dots_fade_out)
				keyboard_devs->LEDs->buffers[j][i*3 + 2] -=
						keyboard_devs->LEDs->buffers[j][i*3 + 2]/keyboard_devs->LEDs->dots_fade_out;
			else
				keyboard_devs->LEDs->buffers[j][i*3 + 2] = 0;
		}
	}
}

void LED_RGB_dots_solid(key_devices_t* keyboard_devs)
{
	for(uint8_t j = 0; j < KEYBOARD_ROWS; j++){
		for(uint8_t i = 0; i < sizeof(keyboard_devs->LEDs->buffers[0]) / 3; i++){
			if(rand() % keyboard_devs->LEDs->dots_random == 0){
				uint32_t color = Wheel((rand() % 255));

				keyboard_devs->LEDs->buffers[j][i*3 + 0] = color & 0xFF;
				keyboard_devs->LEDs->buffers[j][i*3 + 1] = color >> 8 & 0xFF;
				keyboard_devs->LEDs->buffers[j][i*3 + 2] = color >> 16 & 0xFF;
			}
		}
	}
}

void LED_solid(key_devices_t* keyboard_devs)
{
	for(uint8_t j = 0; j < KEYBOARD_ROWS; j++){
		for(uint8_t i = 0; i < sizeof(keyboard_devs->LEDs->buffers[0]) / 3; i++){
			keyboard_devs->LEDs->buffers[j][i*3 + 0] = keyboard_devs->LEDs->solid_red;
			keyboard_devs->LEDs->buffers[j][i*3 + 1] = keyboard_devs->LEDs->solid_blue;
			keyboard_devs->LEDs->buffers[j][i*3 + 2] = keyboard_devs->LEDs->solid_green;
		}
	}
}

void LED_solid_white(key_devices_t* keyboard_devs)
{
	for(uint8_t j = 0; j < KEYBOARD_ROWS; j++){
		for(uint8_t i = 0; i < sizeof(keyboard_devs->LEDs->buffers[0]) / 3; i++){
			keyboard_devs->LEDs->buffers[j][i*3 + 0] = 255;
			keyboard_devs->LEDs->buffers[j][i*3 + 1] = 255;
			keyboard_devs->LEDs->buffers[j][i*3 + 2] = 255;
		}
	}
}

void LED_off(key_devices_t* keyboard_devs)
{
	for(uint8_t j = 0; j < KEYBOARD_ROWS; j++){
		for(uint8_t i = 0; i < sizeof(keyboard_devs->LEDs->buffers[0]) / 3; i++){
			keyboard_devs->LEDs->buffers[j][i*3 + 0] = 0;
			keyboard_devs->LEDs->buffers[j][i*3 + 1] = 0;
			keyboard_devs->LEDs->buffers[j][i*3 + 2] = 0;
		}
	}
}

void LED_null(key_devices_t* keyboard_devs){}

void LED_set_row(key_devices_t* keyboard_devs)
{
	for(uint8_t i = 0; i < sizeof(keyboard_devs->LEDs->buffers[0]) / 3; i++){
		keyboard_devs->LEDs->buffers[keyboard_devs->LEDs->set_row_number][i*3 + 0] = keyboard_devs->LEDs->set_row_colour & 0xFF;
		keyboard_devs->LEDs->buffers[keyboard_devs->LEDs->set_row_number][i*3 + 1] = keyboard_devs->LEDs->set_row_colour >> 8 & 0xFF;
		keyboard_devs->LEDs->buffers[keyboard_devs->LEDs->set_row_number][i*3 + 2] = keyboard_devs->LEDs->set_row_colour >> 16 & 0xFF;
	}
}

void LED_count_row(key_devices_t* keyboard_devs)
{
	static uint32_t timestamp;

	if(HAL_GetTick() - timestamp > keyboard_devs->LEDs->count_delay){
		timestamp = HAL_GetTick();

		keyboard_devs->LEDs->buffers[keyboard_devs->LEDs->count_row_number]
				 [keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_number] * 3 + 0] =
						 keyboard_devs->LEDs->count_row_colour & 0xFF;
		keyboard_devs->LEDs->buffers[keyboard_devs->LEDs->count_row_number]
				 [keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_number] * 3 + 1] =
						 keyboard_devs->LEDs->count_row_colour >> 8 & 0xFF;
		keyboard_devs->LEDs->buffers[keyboard_devs->LEDs->count_row_number]
				 [keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_number] * 3 + 2] =
						 keyboard_devs->LEDs->count_row_colour >> 16 & 0xFF;


		//unset prev row


		if(keyboard_devs->LEDs->count_row_direction){
			if(keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_number] > 0)
				memset(
					&keyboard_devs->LEDs->buffers[keyboard_devs->LEDs->count_row_number]
					  [(keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_number] - 1) * 3]
													   , 0x00
													   , sizeof(uint8_t) * 3);

			if(keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_number] == KEYBOARD_COLS)
				keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_number] = 0;
			else
				keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_number]++;
		}else{
			if(keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_number] == KEYBOARD_COLS)
				memset(
					&keyboard_devs->LEDs->buffers[keyboard_devs->LEDs->count_row_number][0]
													   , 0x00
													   , sizeof(uint8_t) * 3);
			else if(keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_number] < KEYBOARD_COLS)
				memset(
					&keyboard_devs->LEDs->buffers[keyboard_devs->LEDs->count_row_number]
					  [(keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_number] + 1) * 3]
													   , 0x00
													   , sizeof(uint8_t) * 3);

			if(keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_number] == 0)
				keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_number] = KEYBOARD_COLS;
			else
				keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_number]--;
		}
	}
}

void LED_count_all(key_devices_t* keyboard_devs)
{
	static uint32_t timestamp;

