alxhoff/STM32-Mechanical-Keyboard/NuceloKeyboardController/Src/visEffect.c
	if(HAL_GetTick() - timestamp > keyboard_devs->LEDs->count_delay){
		timestamp = HAL_GetTick();

		//SET THE NEW POSITION
		keyboard_devs->LEDs->buffers[keyboard_devs->LEDs->count_row_index]
				 [keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_index] * 3 + 0] =
						 keyboard_devs->LEDs->count_row_colour & 0xFF;
		keyboard_devs->LEDs->buffers[keyboard_devs->LEDs->count_row_index]
				 [keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_index] * 3 + 1] =
						 keyboard_devs->LEDs->count_row_colour >> 8 & 0xFF;
		keyboard_devs->LEDs->buffers[keyboard_devs->LEDs->count_row_index]
				 [keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_index] * 3 + 2] =
						 keyboard_devs->LEDs->count_row_colour >> 16 & 0xFF;

		//IF FORWARDS
		if(keyboard_devs->LEDs->count_row_direction){
			//IF NOT THE FIRST LED IN A ROW
			if(keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_index] > 0)
				memset(
					&keyboard_devs->LEDs->buffers[keyboard_devs->LEDs->count_row_index]
					  [(keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_index] - 1) * 3]
													   , 0x00
													   , sizeof(uint8_t) * 3);
			//ELSE FIRST LED IN A ROW
			else{
				//IF FIRST ROW ON KEYBOARD
				if(keyboard_devs->LEDs->count_row_index == 0)
					memset(
						&keyboard_devs->LEDs->buffers[KEYBOARD_ROWS - 1][(KEYBOARD_COLS - 1) * 3]
													   , 0x00
													   , sizeof(uint8_t) * 3);
				else
					memset(
						&keyboard_devs->LEDs->buffers[keyboard_devs->LEDs->count_row_index - 1]
						  [(KEYBOARD_COLS - 1) * 3]
													   , 0x00
													   , sizeof(uint8_t) * 3);
			}

			if(keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_index] == KEYBOARD_COLS - 1){
				keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_index] = 0;

				goto handle_row;
			}
			else
				keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_index]++;

		}else{
			//IF NOT THE FIRST LED IN A ROW
			if(keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_index] < (KEYBOARD_COLS - 1))
				memset(
					&keyboard_devs->LEDs->buffers[keyboard_devs->LEDs->count_row_index]
					  [(keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_index] + 1) * 3]
													   , 0x00
													   , sizeof(uint8_t) * 3);
			//ELSE FIRST LED IN ROW
			else
				//IF LAST ROW ON KEYBOARD
				if(keyboard_devs->LEDs->count_row_index == (KEYBOARD_ROWS - 1))
					memset(
						&keyboard_devs->LEDs->buffers[0][0]
													   , 0x00
													   , sizeof(uint8_t) * 3);
				else
					memset(
						&keyboard_devs->LEDs->buffers[keyboard_devs->LEDs->count_row_index + 1]
						  [0]
													   , 0x00
													   , sizeof(uint8_t) * 3);
			//IF LAST LED IN ROW
			if(keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_index] == 0){
				keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_index] = KEYBOARD_COLS - 1;

				goto handle_row;
			}
			else
				keyboard_devs->LEDs->count_col_indexs[keyboard_devs->LEDs->count_row_index]--;
		}
	}
	return;
	handle_row:
		if(keyboard_devs->LEDs->count_col_direction){
			if(keyboard_devs->LEDs->count_row_index == (KEYBOARD_ROWS - 1))
				keyboard_devs->LEDs->count_row_index = 0;
			else
				keyboard_devs->LEDs->count_row_index++;
		}else{
			if(keyboard_devs->LEDs->count_row_index == 0)
				keyboard_devs->LEDs->count_row_index = KEYBOARD_ROWS - 1;
			else
				keyboard_devs->LEDs->count_row_index--;
		}
}

void LED_matrix(key_devices_t* keyboard_devs)
{
	static uint32_t timestamp;

	if((HAL_GetTick() - timestamp > keyboard_devs->LEDs->matrix_delay)){
		timestamp = HAL_GetTick();

//		if( xSemaphoreTake(ws2812b.transferSet, (TickType_t) 10) == pdTRUE){
			for(uint8_t j = KEYBOARD_ROWS -1; j > 0; j--){
//				memcpy(keyboard_devs->LEDs->buffers[j], keyboard_devs->LEDs->buffers[j-1], sizeof(keyboard_devs->LEDs->buffers[0]));
//				keyboard_devs->LEDs->buffers[j] = keyboard_devs->LEDs->buffers[j-1];
//				keyboard_devs->LEDs->buffers[j] = keyboard_devs->LEDs->buffers[j-1];
//				keyboard_devs->LEDs->buffers[j] = keyboard_devs->LEDs->buffers[j-1][i*3 + 2];
			}
			for(uint8_t i = 0; i < 1; i++){ //sizeof(keyboard_devs->LEDs->buffers[0]) / 3; i++){
				//shift rows down


	//			//create ghost of now second row in first row
	//			if(KEYBOARD_ROWS >= 2){
	//				//first row
	//				keyboard_devs->LEDs->buffers[0][i*3 + 0] |=  (keyboard_devs->LEDs->buffers[1][i*3 + 0] >> keyboard_devs->LEDs->matrix_fade_amount);
	//				keyboard_devs->LEDs->buffers[0][i*3 + 1] |=  (keyboard_devs->LEDs->buffers[1][i*3 + 1] >> keyboard_devs->LEDs->matrix_fade_amount);
	//				keyboard_devs->LEDs->buffers[0][i*3 + 2] |=  (keyboard_devs->LEDs->buffers[1][i*3 + 2] >> keyboard_devs->LEDs->matrix_fade_amount);
	//			}
	//			//create ghost of now third row in first row
	//			if(KEYBOARD_ROWS >= 3){
	//				//first row
	//				keyboard_devs->LEDs->buffers[0][i*3 + 0] |=  (keyboard_devs->LEDs->buffers[2][i*3 + 0] >> (2 * keyboard_devs->LEDs->matrix_fade_amount));
	//				keyboard_devs->LEDs->buffers[0][i*3 + 1] |=  (keyboard_devs->LEDs->buffers[2][i*3 + 1] >> (2 * keyboard_devs->LEDs->matrix_fade_amount));
	//				keyboard_devs->LEDs->buffers[0][i*3 + 2] |=  (keyboard_devs->LEDs->buffers[2][i*3 + 2] >> (2 * keyboard_devs->LEDs->matrix_fade_amount));
	//			}

				//set first row
	//			if((rand() % 100) < keyboard_devs->LEDs->matrix_probability){
	//				keyboard_devs->LEDs->buffers[0][i*3 + 0] = keyboard_devs->LEDs->matrix_red ;
	//				keyboard_devs->LEDs->buffers[0][i*3 + 1] = keyboard_devs->LEDs->matrix_blue;
	//				keyboard_devs->LEDs->buffers[0][i*3 + 2] = keyboard_devs->LEDs->matrix_green;
	//			}else{
	//				keyboard_devs->LEDs->buffers[0][i*3 + 0] = 0;
	//				keyboard_devs->LEDs->buffers[0][i*3 + 1] = 0;
	//				keyboard_devs->LEDs->buffers[0][i*3 + 2] = 0;
	//			}



		}
	}
}

void visInit(key_devices_t* keyboard_devs)
{
	uint8_t i;

	keyboard_devs->LEDs = (LED_array_t*) calloc(1, sizeof(LED_array_t));

	//set effect parameters
	keyboard_devs->LEDs->rainbow_delay = 15;
	keyboard_devs->LEDs->rainbow_effect_length = 15;

	keyboard_devs->LEDs->dots_fade_out= 40;
	keyboard_devs->LEDs->dots_random = 50;

	keyboard_devs->LEDs->solid_red = 0;
	keyboard_devs->LEDs->solid_green = 0;
	keyboard_devs->LEDs->solid_blue = 255;

